# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [7]:
ran1 = pd.Series(np.random.randint(1,5,100))
ran2 = pd.Series(np.random.randint(1,4,100))
ran3 = pd.Series(np.random.randint(10000,30000,100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [9]:
df = pd.concat([ran1,ran2,ran3], axis=1)

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [12]:
df.columns = ['bedrs', 'bathrs', 'price_sqr_meter']
df.head()

   bedrs  bathrs  price_sqr_meter
0      3       2            17415
1      2       3            13224
2      2       3            17467
3      2       2            19226
4      3       3            29860

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [29]:
df1 = pd.concat([ran1,ran2,ran3], axis=0)
bigcolumn = pd.DataFrame(df1)

### Step 6. Ops it seems it is going only until index 99. Is it true?

In [21]:
df1.shape[0]

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [25]:
df1.reset_index(drop=True,inplace = True)
df1

0          3
1          2
2          2
3          2
4          3
5          2
6          3
7          4
8          2
9          3
10         2
11         3
12         1
13         2
14         2
15         4
16         2
17         4
18         2
19         2
20         4
21         4
22         4
23         1
24         2
25         1
26         3
27         1
28         4
29         3
       ...
270    23656
271    14146
272    19583
273    22097
274    23226
275    20967
276    21175
277    22508
278    18887
279    10212
280    13983
281    14237
282    26128
283    29796
284    12551
285    13590
286    25766
287    13884
288    29011
289    10171
290    25965
291    13128
292    26241
293    22178
294    21112
295    16517
296    19806
297    20822
298    25036
299    16195
Length: 300, dtype: int32